using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace FlashWing.HIME.Model.Common.Enum
{
    public enum BuffType
    {
        火力,
        脱力,
        护盾,
        上限提高,
        下限提高,
        上限降低,
        下限降低,
        全速,
        干扰,
        装甲,
        破甲,
        动力,
        止步,
        迟缓,
        偏折,
        悬浮,
        免疫,
        起火,
        触发几率提高1,
        触发几率提高2,
        触发几率提高3,
        触发几率提高4,
        触发几率提高5,
        触发几率提高6,
        触发几率提高7,
        触发几率提高8,
        触发几率提高9,
        触发几率提高10,
        触发几率提高11,
        触发几率提高12,
        触发几率提高13,
        触发几率提高14,
        触发几率提高15,
        触发几率提高16,
        触发几率提高17,
        触发几率提高18,
        触发几率提高19,
        触发几率提高20,
        触发几率提高21,
        触发几率提高22,
        触发几率提高23,
        触发几率提高24,
        触发几率提高25,
        触发几率提高26,
        触发几率提高27,
        触发几率提高28,
        触发几率提高29,
        触发几率提高30,
        触发概率31,
        触发概率32,
        套装火力,
        暴击率提高,
        套装动力,
        伪报
    }
}
